rotten-potatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (?, ?, ?, ?)  [["rating", "G"], ["rating", "PG"], ["rating", "PG-13"], ["rating", "R"]]
---
def index



    if (params[:ratings] == nil && session[:ratings] != nil) || (params[:sort] == nil && session[:sort] != nil)
      flash.keep
      redirect_to movies_path(ratings: session[:ratings] || params.permit[:ratings], sort: session[:sort] || params.permit[:sort])
    end

    session[:sort] = params[:sort]

    #working
    session[:ratings] = params[:ratings]


    if params[:ratings] != nil
      @aratings = ['G','PG','PG-13','R']
      @checked = Hash[['G','PG','PG-13','R'].map{|r|[ r, (params[:ratings].keys).include?(r)]}]
      @movies = Movie.where(rating: params[:ratings].keys)
    else
      @aratings = ['G','PG','PG-13','R']
      @checked = Hash[['G','PG','PG-13','R'].map{|r|[ r, ['G','PG','PG-13','R'].include?(r)]}]
      @movies = Movie.where(rating: ['G','PG','PG-13','R'])
    end

    if params[:sort] == "release_date"
  		@movies = @movies.all.sort_by{|e| e[:release_date]}
    end
    if params[:sort] == "title"
    		@movies = @movies.all.sort_by{|e| e[:title]}